[AdvRaptorM1 X2CharacterTemplate]
strCharacterName="Raptor Commando"

[AdvRaptorM2 X2CharacterTemplate]
strCharacterName="Advanced Raptor Commando"

[AdvRaptorM3 X2CharacterTemplate]
strCharacterName="Elite Raptor Commando"

[AdvRaptorM1_WPN X2WeaponTemplate]
FriendlyName="Raptor Sniper Rifle"

[AdvRaptorM2_WPN X2WeaponTemplate]
FriendlyName="Raptor Sniper Rifle"

[AdvRaptorM3_WPN X2WeaponTemplate]
FriendlyName="Raptor Sniper Rifle"

[AdvWraithM1 X2CharacterTemplate]
strCharacterName="Wraith Commando"

[AdvWraithM2 X2CharacterTemplate]
strCharacterName="Advanced Wraith Commando"

[AdvWraithM3 X2CharacterTemplate]
strCharacterName="Elite Wraith Commando"

[WraithGauntletM1_BM X2PairedWeaponTemplate]
FriendlyName="Ethereal Shard Gaunlet"

[WraithGauntletM2_BM X2PairedWeaponTemplate]
FriendlyName="Ethereal Shard Gaunlet"

[WraithGauntletM3_BM X2PairedWeaponTemplate]
FriendlyName="Ethereal Shard Gaunlet"

[WraithPistolM1_WPN X2WeaponTemplate]
FriendlyName="Wraith Psi Pistol"

[WraithPistolM2_WPN X2WeaponTemplate]
FriendlyName="Wraith Psi Pistol"

[WraithPistolM3_WPN X2WeaponTemplate]
FriendlyName="Wraith Psi Pistol"

[AdvDestroyerM1 X2CharacterTemplate]
strCharacterName="Destroyer Commando"

[AdvDestroyerM2 X2CharacterTemplate]
strCharacterName="Advanced Destroyer Commando"

[AdvDestroyerM3 X2CharacterTemplate]
strCharacterName="Elite Destroyer Commando"

[AdvDestroyerM1_WPN X2WeaponTemplate]
FriendlyName="Destroyer Assault Rifle"

[AdvDestroyerM2_WPN X2WeaponTemplate]
FriendlyName="Destroyer Assault Rifle"

[AdvDestroyerM3_WPN X2WeaponTemplate]
FriendlyName="Destroyer Assault Rifle"

[DestroyerWristBladeM1_BM X2PairedWeaponTemplate]
FriendlyName="Destroyer Gaunlet"

[DestroyerWristBladeM2_BM X2PairedWeaponTemplate]
FriendlyName="Destroyer Gaunlet"

[DestroyerWristBladeM3_BM X2PairedWeaponTemplate]
FriendlyName="Destroyer Gaunlet"


[PsiDroneM1 X2CharacterTemplate]
strCharacterName="Phase Drone"

[PsiDroneM2 X2CharacterTemplate]
strCharacterName="Phase Drone"

[PsiDroneM3 X2CharacterTemplate]
strCharacterName="Phase Drone"

[XCOMPsiDrone X2CharacterTemplate]
strCharacterName="Phase Drone"

[PsiDroneBeamM1_WPN X2WeaponTemplate]
FriendlyName="Drone Phase Blaster"

[PsiDroneBeamM2_WPN X2WeaponTemplate]
FriendlyName="Drone Phase Blaster"

[PsiDroneBeamM3_WPN X2WeaponTemplate]
FriendlyName="Drone Phase Blaster"

[PsiDroneLauncher_WPN X2WeaponTemplate]
FriendlyName="Micro Launcher"

[CorpsePsiDrone X2ItemTemplate]
FriendlyName="Phase Drone Wreck"
FriendlyNamePlural="Phase Drone Wrecks"
BriefSummary="We have seen ADVENT deploy verious drone types in the past, but this drone seems to be designed to work in conjunction with select other units. It's not very durable but quick, agile and seems to have a very large detection range. It also has the ability to phase though solid objects. We should try rebuilding one and deploying it with our soldiers."
 
[AutopsyPhaseDrone X2TechTemplate]
DisplayName="Phase Drone Autopsy"
Summary="The Phase Drone is a small, fast drone that can phase through walls and has a very large detection range."
CodeName="Pokeball"
LongDescription="The Phase Drone looks to be a simple creation at first sight. On closer examination, it would seem that the drone has been given some sort of phase tech. The drone is very quick and has a small but deadly weapon arsonal. While it is rare to find or capture these drones intact, if we should find more salvageable wrecks, it might be smart to rebuild it and deploy it in the field for our troops Commander. R. Tygan."
 

[DeployablePhaseDrone X2AbilityTemplate]
LocFriendlyName="Deployable Phase Drone"
LocLongDescription="Deploys a XCOM Phase Drone at the specified location."
LocHelpText="Deploys a XCOM Celatid Phase Drone at the specified location."
LocFlyOverText="Deploy Phase Drone"

[DeployablePhaseDrone X2WeaponTemplate]
FriendlyName="Deployable Phase Drone"
BriefSummary="The Phase Drone provides additional scouting and fire support for our soldiers. It has a detection radius of 15 tiles. It is deployed like a grenade, thrown to the spot where the Drone will deploy."
TacticalText="<Bullet/> Deploys a XCOM Phase Drone to a specified location.\n<Bullet/>Can mark targets.\n<Bullet/>Does not expire until destroyed."

[WraithVest X2EquipmentTemplate]
FriendlyName="Wraith Vest"
FriendlyNamePlural="Wraith Vests"
BriefSummary="A light armor underlay worn by the ADVENT Wraith Commando, can be worn with all XCOM armors to increase soldier health."
TacticalText="<Bullet/> Grants a small boost to soldier health.\n<Bullet/> Grants the Lightning Reflexes and Wall Phasing abilities."

[DummyWraithVest X2EquipmentTemplate]
FriendlyName="Wraith Vest"
FriendlyNamePlural="Wraith Vests"
BriefSummary="A light armor underlay worn by the ADVENT Wraith Commando, can be worn with all XCOM armors to increase soldier health."
TacticalText="<Bullet/> Grants a small boost to soldier health.\n<Bullet/> Grants Wall Phasing."

[WallPhasing X2AbilityTemplate]
LocFriendlyName="Wraith"
LocHelpText="This armor incorporates a dimensional shift to allow the wearer to pass freely through obstacles."
LocLongDescription="This armor allows the unit to pass directly through obstacles."
LocFlyOverText="Phased"

[WraithInvert X2AbilityTemplate]
LocFriendlyName="Invert"
LocLongDescription="Switch locations with an enemy unit. Costs 1 Focus."
LocHelpText="Switch locations with an enemy unit. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Wraith Invert has a 2 turn cooldown, and does not end the Wraith's turn."

[RaptorPsiStrike X2AbilityTemplate]
LocFriendlyName="Psi Strike"
LocHelpText="Cast a powerful Psi Strike to push and knock back targets out of cover while disorienting them."
LocLongDescription="<Bullet/> Psi Strike is a powerful Psi ability that pushes and knocks targets back out of cover<br><Bullet/>Will cause disorientation<br>"


[AdvRaptorStandardFire X2AbilityTemplate]
LocFriendlyName="Fire Sniper Rifle"
LocHelpText="Fire your Sniper rifle at a target."
LocLongDescription="<Bullet/> The Raptor's rifle is powerful and accurate at long range, but always requires two actions to fire<br><Bullet/>Firing the primary weapon always ends a soldier's turn<br>"

[AdvRaptorRifleOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to to aim."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[AdvRaptorSquadsight X2AbilityTemplate]
LocFriendlyName="Squadsight"
LocLongDescription="The Advent Raptor can target enemies within squadmates' sight, provided there is line of sight to the target."
LocHelpText="The Advent Raptor can target enemies within squadmates' sight, provided there is line of sight to the target."
LocFlyOverText="Squadsight"

[AdvRaptorLongWatch X2AbilityTemplate]
LocFriendlyName="Long Watch"
LocLongDescription="Allow Overwatch to trigger with Squadsight."
LocHelpText="Fire on the first enemy that moves within your line of sight (in Squadsight range.)"
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight (in Squadsight range), but only if you are revealed."
LocFlyOverText="Long Watch"

[AdvRaptorLongWatchShot X2AbilityTemplate]
LocFriendlyName="Long Watch Shot"

[RaptorJump X2AbilityTemplate]
LocFriendlyName="Raptor Jump"
LocLongDescription="The propulsion jets built into the Raptor armor allows a soldier to instantly launch themselves to a new position."
LocHelpText="Jump to a new location. Bypasses all overwatch and reaction fire."
LocFlyOverText="Raptor Jump"

[DemolitionShot X2AbilityTemplate]
LocFriendlyName="Demolition Shot"
LocLongDescription="Unleash a volley at your target's cover, significantly damaging or destroying it. Deals no damage to your target."
LocHelpText="Fire at your target's cover, significantly damaging or destroying it. Deals no damage to your target."
LocFlyOverText="Demolition Shot"
LocPromotionPopupText="<Bullet/> Demolition Shot requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Demolition Shot does increased environmental damage, and will destroy most cover objects.<br/>"
LocMissMessage="Missed!"


[CommandoEnergyShield X2AbilityTemplate]
LocFriendlyName="Energy Shield"
LocLongDescription="The Destroyer Commando can grant an energy shield to all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project an energy shield around nearby allies and yourself."
LocFlyOverText="Energy Shield"

[CommandoEnergyShieldMk2 X2AbilityTemplate]
LocFriendlyName="Energy Shield"
LocLongDescription="The Destroyer Commando can grant an energy shield to all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project an energy shield around nearby allies and yourself."
LocFlyOverText="Energy Shield"

[CommandoEnergyShieldMk3 X2AbilityTemplate]
LocFriendlyName="Energy Shield"
LocLongDescription="The Destroyer Commando can grant an energy shield to all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project an energy shield around nearby allies and yourself."
LocFlyOverText="Energy Shield"

[CommandoKineticPlating X2AbilityTemplate]
LocFriendlyName="Kinetic Plating"
LocLongDescription="Missed shots against the Destroyer Commando will generate shielding."
LocHelpText="Missed shots against the Destroyer Commando will generate shielding."
LocFlyoverText="Kinetic Plating!"

[CommandoKineticPlatingMk2 X2AbilityTemplate]
LocFriendlyName="Kinetic Plating"
LocLongDescription="Missed shots against the Destroyer Commando will generate shielding."
LocHelpText="Missed shots against the Destroyer Commando will generate shielding."
LocFlyoverText="Kinetic Plating!"

[CommandoKineticPlatingMk3 X2AbilityTemplate]
LocFriendlyName="Kinetic Plating"
LocLongDescription="Missed shots against the Destroyer Commando will generate shielding."
LocHelpText="Missed shots against the Destroyer Commando will generate shielding."
LocFlyoverText="Kinetic Plating!"

[DestroyerPull X2AbilityTemplate]
LocFriendlyName="Psi Pull"
LocHelpText="Uses Psi Power to pull a target in close for a close combat attack."
LocLongDescription="<Bullet/> Psi Pull is a Psi ability that pulls targets close for a Psi Blade attack.<br><Bullet/>Can cause Panic.<br>"
LocMissMessage="Psi Pull Missed!"

[PsiDroneLauncher X2AbilityTemplate]
LocFriendlyName="Phase Drone Micro Missile"
LocLongDescription="The Phase Drone is equiped with a secondary Micro Launcher that fires a single Micro Missile."
LocHelpText="Fire a Micro Missile at a target area."
LocFlyoverText="Fire Micro Missile!"

[WraithBladestorm X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[WraithBladestormAttack X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"





